Repository: gerege-systems/petronet-gerege-nexus
Catalog: native-apps/desktop/windows/src/PetroNetDesktop.Client/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, es_es, fr_fr, mn_mn, ru_ru, zh_cn

# App_Tagline
source: Digital Sovereignty
ar_sa: السيادة الرقمية
es_es: Soberanía digital
fr_fr: Souveraineté numérique
ru_ru: Цифровой суверенитет
zh_cn: 数字主权

# App_Wordmark_Top
source: National ID
ar_sa: الهوية الوطنية
es_es: Identidad nacional
fr_fr: Identité nationale
ru_ru: Удостоверение личности
zh_cn: 国家身份

# Nav_Home
source: Home
ar_sa: الرئيسية
es_es: Inicio
fr_fr: Accueil
mn_mn: Эхлэл
ru_ru: Главная
zh_cn: 首页

# Nav_Platform
source: Platform
ar_sa: المنصة
es_es: Plataforma
fr_fr: Plateforme
mn_mn: Платформ
ru_ru: Платформа
zh_cn: 平台

# Nav_Verify
source: Verify Certificate
ar_sa: التحقق من شهادة
es_es: Verificar certificado
fr_fr: Vérifier un certificat
mn_mn: Гэрчилгээ шалгах
ru_ru: Проверка сертификата
zh_cn: 验证证书

# Nav_Login
source: Sign In
ar_sa: تسجيل الدخول
es_es: Iniciar sesión
fr_fr: Connexion
mn_mn: Нэвтрэх
ru_ru: Вход
zh_cn: 登录

# Nav_Dashboard
source: Dashboard
ar_sa: لوحة التحكم
es_es: Panel
fr_fr: Tableau de bord
mn_mn: Хяналтын самбар
ru_ru: Панель
zh_cn: 控制台

# Nav_Settings
source: Settings
ar_sa: الإعدادات
es_es: Ajustes
fr_fr: Paramètres
mn_mn: Тохиргоо
ru_ru: Настройки
zh_cn: 设置

# Nav_Logout
source: Sign out
ar_sa: تسجيل الخروج
es_es: Cerrar sesión
fr_fr: Se déconnecter
mn_mn: Гарах
ru_ru: Выйти
zh_cn: 退出登录

# Nav_Tokens
source: Tokens
ar_sa: المفاتيح
mn_mn: Токенууд
ru_ru: Токены
zh_cn: 令牌

# Tokens_Title
source: USB token management
ar_sa: إدارة مفاتيح USB
es_es: Gestión de tokens USB
fr_fr: Gestion des tokens USB
mn_mn: USB токен удирдлага
ru_ru: Управление USB-токенами
zh_cn: USB 令牌管理

# Tokens_Subtitle
source: Browse connected smart cards / USB tokens, configure them, and enroll certificates.
ar_sa: استعرض البطاقات الذكية / مفاتيح USB المتصلة، واضبطها، وسجّل الشهادات.
es_es: Explore las tarjetas inteligentes / tokens USB conectados, configúrelos y emita certificados.
fr_fr: Parcourez les cartes à puce / tokens USB connectés, configurez-les et enrôlez des certificats.
mn_mn: Холбогдсон smart card / USB токенуудыг харах, тохируулах, сертификатаар бүртгүүлэх
ru_ru: Просматривайте подключённые смарт-карты / USB-токены, настраивайте их и выпускайте сертификаты.
zh_cn: 查看已连接的智能卡 / USB 令牌，进行配置并签发证书。

# Nav_Organizations
source: Organizations
ar_sa: المؤسسات
es_es: Organizaciones
fr_fr: Organisations
mn_mn: Байгууллага
ru_ru: Организации
zh_cn: 组织机构

# Org_Title
source: Organizations
ar_sa: المؤسسات
es_es: Organizaciones
fr_fr: Organisations
mn_mn: Байгууллага
ru_ru: Организации
zh_cn: 组织机构

# Org_Subtitle
source: Manage organization digital signatures
ar_sa: إدارة التوقيعات الإلكترونية للمؤسسة
es_es: Gestione las firmas electrónicas de la organización
fr_fr: Gérer les signatures électroniques d'organisation
mn_mn: Байгууллагын тоон гарын үсэг удирдах
ru_ru: Управление цифровыми подписями организации
zh_cn: 管理组织的数字签名

# Org_List_Header
source: Registered organizations
ar_sa: المؤسسات المسجَّلة
es_es: Organizaciones registradas
fr_fr: Organisations enregistrées
mn_mn: Бүртгэгдсэн байгууллагууд
ru_ru: Зарегистрированные организации
zh_cn: 已注册的组织

# Org_List_Empty
source: You are not registered with any organization yet.
ar_sa: لست مسجَّلاً في أي مؤسسة بعد.
es_es: Todavía no está registrado en ninguna organización.
fr_fr: Vous n'êtes encore enregistré dans aucune organisation.
mn_mn: Та одоогоор ямар ч байгууллагад бүртгэлгүй байна.
ru_ru: Вы ещё не зарегистрированы ни в одной организации.
zh_cn: 您尚未在任何组织中注册。

# Org_Register_Button
source: Register Organization
ar_sa: تسجيل مؤسسة
es_es: Registrar organización
fr_fr: Enregistrer une organisation
mn_mn: Байгууллага бүртгэх
ru_ru: Зарегистрировать организацию
zh_cn: 注册组织

# Org_Back
source: Back
ar_sa: رجوع
es_es: Atrás
fr_fr: Retour
mn_mn: Буцах
ru_ru: Назад
zh_cn: 返回

# Org_RegNumber
source: Org registry number
ar_sa: رقم سجل المؤسسة
es_es: Número de registro de la organización
fr_fr: Numéro de registre de l'organisation
mn_mn: ААН-ийн регистр
ru_ru: Регистрационный номер организации
zh_cn: 组织登记号

# Org_Search
source: Search
ar_sa: بحث
es_es: Buscar
fr_fr: Rechercher
mn_mn: Хайх
ru_ru: Поиск
zh_cn: 搜索

# Org_Expiry_Section
source: Signing window
ar_sa: نافذة التوقيع
es_es: Ventana de firma
fr_fr: Fenêtre de signature
mn_mn: Гарын үсэг зурах хугацаа
ru_ru: Окно подписания
zh_cn: 签名有效期

# Org_Expiry_Now
source: Now (5 min)
ar_sa: الآن (5 دقائق)
es_es: Ahora (5 min)
fr_fr: Maintenant (5 min)
mn_mn: Одоо (5 минут)
ru_ru: Сейчас (5 мин)
zh_cn: 立即（5 分钟）

# Org_Expiry_3Days
source: Within 3 days
ar_sa: خلال 3 أيام
es_es: En 3 días
fr_fr: Sous 3 jours
mn_mn: 3 хоногийн дотор
ru_ru: В течение 3 дней
zh_cn: 3 天内

# Org_Expiry_7Days
source: Within 7 days
ar_sa: خلال 7 أيام
es_es: En 7 días
fr_fr: Sous 7 jours
mn_mn: 7 хоногийн дотор
ru_ru: В течение 7 дней
zh_cn: 7 天内

# Org_Expiry_30Days
source: Within 30 days
ar_sa: خلال 30 يوماً
es_es: En 30 días
fr_fr: Sous 30 jours
mn_mn: 30 хоногийн дотор
ru_ru: В течение 30 дней
zh_cn: 30 天内

# Org_Verification
source: VERIFICATION CODE
ar_sa: رمز التحقق
es_es: CÓDIGO DE VERIFICACIÓN
fr_fr: CODE DE VÉRIFICATION
mn_mn: БАТАЛГААЖУУЛАХ КОД
ru_ru: КОД ПОДТВЕРЖДЕНИЯ
zh_cn: 验证码

# Org_Waiting
source: Waiting...
ar_sa: بالانتظار…
es_es: Esperando…
fr_fr: En attente…
mn_mn: Хүлээж байна...
ru_ru: Ожидание...
zh_cn: 等待中...

# Org_Cancel
source: Cancel
ar_sa: إلغاء
es_es: Cancelar
fr_fr: Annuler
mn_mn: Цуцлах
ru_ru: Отмена
zh_cn: 取消

# Org_Continue
source: Continue
ar_sa: متابعة
es_es: Continuar
fr_fr: Continuer
mn_mn: Үргэлжлүүлэх
ru_ru: Продолжить
zh_cn: 继续

# Org_Members_Section
source: Members
ar_sa: الأعضاء
es_es: Miembros
fr_fr: Membres
mn_mn: Гишүүд
ru_ru: Участники
zh_cn: 成员

# Org_AddMember
source: Add member
ar_sa: إضافة عضو
es_es: Añadir miembro
fr_fr: Ajouter un membre
mn_mn: Гишүүн нэмэх
ru_ru: Добавить участника
zh_cn: 添加成员

# Org_AddMember_Submit
source: Add
ar_sa: إضافة
es_es: Añadir
fr_fr: Ajouter
mn_mn: Нэмэх
ru_ru: Добавить
zh_cn: 添加

# Org_RemoveMember
source: Remove
ar_sa: إزالة
es_es: Quitar
fr_fr: Retirer
mn_mn: Хасах
ru_ru: Удалить
zh_cn: 移除

# Org_RemoveMember_Confirm
source: Remove member?
ar_sa: إزالة العضو؟
es_es: ¿Quitar al miembro?
fr_fr: Retirer ce membre ?
mn_mn: Гишүүнийг хасах уу?
ru_ru: Удалить участника?
zh_cn: 确定移除该成员？

# Org_Role_Signer
source: Signer
ar_sa: موقّع
es_es: Firmante
fr_fr: Signataire
mn_mn: Гарын үсэг зурагч
ru_ru: Подписант
zh_cn: 签署人

# Org_Role_Admin
source: Admin
ar_sa: مسؤول
es_es: Administrador
fr_fr: Administrateur
mn_mn: Админ
ru_ru: Администратор
zh_cn: 管理员

# Org_Member_Active
source: Active
ar_sa: نشط
es_es: Activo
fr_fr: Actif
mn_mn: Идэвхтэй
ru_ru: Активен
zh_cn: 在用

# Org_Member_Pending
source: Pending
ar_sa: قيد الانتظار
es_es: Pendiente
fr_fr: En attente
mn_mn: Хүлээгдэж буй
ru_ru: Ожидает
zh_cn: 待处理

# Org_Status_Active
source: Active
ar_sa: نشط
es_es: Activo
fr_fr: Actif
mn_mn: Идэвхтэй
ru_ru: Активна
zh_cn: 有效

# Org_Status_Pending
source: Pending
ar_sa: قيد الانتظار
es_es: Pendiente
fr_fr: En attente
mn_mn: Хүлээгдэж буй
ru_ru: Ожидает
zh_cn: 待处理

# Org_Status_Suspended
source: Suspended
ar_sa: موقوف
es_es: Suspendido
fr_fr: Suspendu
mn_mn: Түр зогссон
ru_ru: Приостановлена
zh_cn: 已暂停

# Org_Status_Removed
source: Removed
ar_sa: مُزال
es_es: Eliminado
fr_fr: Retiré
mn_mn: Хасагдсан
ru_ru: Удалена
zh_cn: 已移除

# Org_Status_Unknown
source: Unknown
ar_sa: غير معروف
es_es: Desconocido
fr_fr: Inconnu
mn_mn: Тодорхойгүй
ru_ru: Неизвестно
zh_cn: 未知

# Org_EnglishName
source: English name
ar_sa: الاسم بالإنجليزية
es_es: Nombre en inglés
fr_fr: Nom en anglais
mn_mn: Англи нэр
ru_ru: Название на английском
zh_cn: 英文名称

# Org_EnglishName_Unset
source: Not set
ar_sa: غير محدد
es_es: Sin definir
fr_fr: Non défini
mn_mn: Тогтоогүй
ru_ru: Не задано
zh_cn: 未设置

# Org_Edit
source: Edit
ar_sa: تعديل
es_es: Editar
fr_fr: Modifier
mn_mn: Засах
ru_ru: Изменить
zh_cn: 编辑

# Org_Save
source: Save
ar_sa: حفظ
es_es: Guardar
fr_fr: Enregistrer
mn_mn: Хадгалах
ru_ru: Сохранить
zh_cn: 保存

# Org_LookupCard_Type
source: Type
ar_sa: النوع
es_es: Tipo
mn_mn: Төрөл
ru_ru: Тип
zh_cn: 类型

# Org_LookupCard_Ceo
source: CEO
ar_sa: المدير التنفيذي
es_es: Director ejecutivo
fr_fr: Directeur général
mn_mn: Захирал
ru_ru: Руководитель
zh_cn: 法定代表人

# Org_LookupCard_Phone
source: Phone
ar_sa: الهاتف
es_es: Teléfono
fr_fr: Téléphone
mn_mn: Утас
ru_ru: Телефон
zh_cn: 电话

# Org_Error_Generic
source: An error occurred.
ar_sa: حدث خطأ.
es_es: Se produjo un error.
fr_fr: Une erreur est survenue.
mn_mn: Алдаа гарлаа.
ru_ru: Произошла ошибка.
zh_cn: 发生错误。

# Org_Error_RegNumberTooShort
source: Registry number is too short.
ar_sa: رقم السجل قصير جداً.
es_es: El número de registro es demasiado corto.
fr_fr: Le numéro de registre est trop court.
mn_mn: Регистр хэт богино байна.
ru_ru: Регистрационный номер слишком короткий.
zh_cn: 登记号过短。

# Org_Error_NotFound
source: No organization found with this registry number.
ar_sa: لا توجد مؤسسة بهذا الرقم في السجل.
es_es: No se encontró ninguna organización con ese número de registro.
fr_fr: Aucune organisation trouvée avec ce numéro de registre.
mn_mn: Энэ регистраар байгууллага олдсонгүй.
ru_ru: Организация с таким регистрационным номером не найдена.
zh_cn: 未找到该登记号对应的组织。

# Org_Error_NotCeo
source: You are not the CEO of this organization.
ar_sa: أنت لست المدير التنفيذي لهذه المؤسسة.
es_es: Usted no es el director ejecutivo de esta organización.
fr_fr: Vous n'êtes pas le directeur général de cette organisation.
mn_mn: Та энэ байгууллагын захирал биш байна.
ru_ru: Вы не являетесь руководителем этой организации.
zh_cn: 您不是该组织的法定代表人。

# Org_Error_AlreadyRegistered
source: This organization is already registered.
ar_sa: هذه المؤسسة مسجَّلة بالفعل.
es_es: Esta organización ya está registrada.
fr_fr: Cette organisation est déjà enregistrée.
mn_mn: Энэ байгууллага аль хэдийн бүртгэлтэй.
ru_ru: Эта организация уже зарегистрирована.
zh_cn: 该组织已注册。

# Org_Error_ExpiryCap
source: The selected window exceeds the allowed cap.
ar_sa: النافذة المختارة تتجاوز الحد المسموح.
es_es: La ventana seleccionada supera el límite permitido.
fr_fr: La fenêtre choisie dépasse la limite autorisée.
mn_mn: Сонгосон хугацаа хязгаараас давсан байна.
ru_ru: Выбранное окно превышает допустимый предел.
zh_cn: 所选有效期超出允许上限。

# Org_Error_XypUnavailable
source: State registry gateway is temporarily unavailable.
ar_sa: بوابة السجل الحكومي غير متاحة مؤقتاً.
es_es: La pasarela del registro estatal no está disponible temporalmente.
fr_fr: La passerelle du registre national est temporairement indisponible.
mn_mn: Улсын бүртгэлийн сүлжээ түр ажиллахгүй байна.
ru_ru: Шлюз государственного реестра временно недоступен.
zh_cn: 国家登记网关暂时不可用。

# Org_Error_NotImplemented
source: This feature is not implemented yet.
ar_sa: هذه الميزة غير متاحة بعد.
es_es: Esta función aún no está implementada.
fr_fr: Cette fonctionnalité n'est pas encore disponible.
mn_mn: Энэ функц хараахан хэрэгжээгүй байна.
ru_ru: Эта функция ещё не реализована.
zh_cn: 该功能尚未实现。

# Org_Error_SelectExpiry
source: Select an expiry window.
ar_sa: اختر نافذة الصلاحية.
es_es: Seleccione una ventana de validez.
fr_fr: Sélectionnez une fenêtre de validité.
mn_mn: Хугацаагаа сонгоно уу.
ru_ru: Выберите окно действия.
zh_cn: 请选择有效期。

# Org_Error_SignTimeout
source: Session timed out.
ar_sa: انتهت مهلة الجلسة.
es_es: La sesión ha caducado.
fr_fr: La session a expiré.
mn_mn: Хугацаа дууссан.
ru_ru: Время сессии истекло.
zh_cn: 会话已超时。

# Home_Title
source: PetroNet — Mongolian Electronic ID
ar_sa: PetroNet — الهوية الإلكترونية المنغولية
es_es: PetroNet — identidad electrónica de Mongolia
fr_fr: PetroNet — identité électronique mongole
mn_mn: PetroNet — Монголын цахим иргэний үнэмлэх
ru_ru: PetroNet — электронное удостоверение личности Монголии
zh_cn: PetroNet —— 蒙古国电子身份证

# Home_Subtitle
source: Remote digital signing, sign-in, and certificate verification.
ar_sa: التوقيع الرقمي عن بُعد وتسجيل الدخول والتحقق من الشهادات.
es_es: Firma digital remota, inicio de sesión y verificación de certificados.
fr_fr: Signature électronique à distance, connexion et vérification de certificats.
mn_mn: Алсын дижитал гарын үсэг, нэвтрэлт, гэрчилгээ баталгаажуулалт.
ru_ru: Удалённое подписание, вход и проверка сертификатов.
zh_cn: 远程数字签名、登录与证书验证。

# Home_Backend_Title
source: Backend status
ar_sa: حالة الخادم
es_es: Estado del servidor
fr_fr: État du serveur
mn_mn: Серверийн төлөв
ru_ru: Состояние сервера
zh_cn: 后端状态

# Home_Backend_Version
source: Version
ar_sa: الإصدار
es_es: Versión
mn_mn: Хувилбар
ru_ru: Версия
zh_cn: 版本

# Home_Backend_LastChecked
source: Last checked
ar_sa: آخر فحص
es_es: Última comprobación
fr_fr: Dernière vérification
mn_mn: Сүүлд шалгасан
ru_ru: Последняя проверка
zh_cn: 最近检查

# Home_Backend_Refresh
source: Refresh
ar_sa: تحديث
es_es: Actualizar
fr_fr: Actualiser
mn_mn: Шинэчлэх
ru_ru: Обновить
zh_cn: 刷新

# Home_Status_Unknown
source: Unknown
ar_sa: غير معروف
es_es: Desconocido
fr_fr: Inconnu
mn_mn: Тодорхойгүй
ru_ru: Неизвестно
zh_cn: 未知

# Home_Status_Checking
source: Checking…
ar_sa: جارٍ الفحص…
es_es: Comprobando…
fr_fr: Vérification…
mn_mn: Шалгаж байна…
ru_ru: Проверка…
zh_cn: 检查中…

# Home_Status_Healthy
source: Connected
ar_sa: متصل
es_es: Conectado
fr_fr: Connecté
mn_mn: Холбогдсон
ru_ru: Подключено
zh_cn: 已连接

# Home_Status_Degraded
source: Some services unhealthy
ar_sa: بعض الخدمات غير سليمة
es_es: Algunos servicios no funcionan
fr_fr: Certains services sont dégradés
mn_mn: Зарим үйлчилгээ хариулахгүй
ru_ru: Часть сервисов недоступна
zh_cn: 部分服务异常

# Home_Status_Unreachable
source: Backend unreachable
ar_sa: الخادم غير متاح
es_es: Servidor inaccesible
fr_fr: Serveur injoignable
mn_mn: Сервер хариулахгүй
ru_ru: Сервер недоступен
zh_cn: 无法连接后端

# Verify_Title
source: Verify Certificate
ar_sa: التحقق من شهادة
es_es: Verificar certificado
fr_fr: Vérifier un certificat
mn_mn: Гэрчилгээ шалгах
ru_ru: Проверка сертификата
zh_cn: 验证证书

# Verify_Subtitle
source: Drop a PEM or DER X.509 certificate, or paste it as text to inspect.
ar_sa: أفلت شهادة X.509 (PEM أو DER) أو الصقها كنص لفحصها.
es_es: Suelte un certificado X.509 (PEM o DER) o péguelo como texto para inspeccionarlo.
fr_fr: Déposez un certificat X.509 (PEM ou DER) ou collez-le en texte pour l'inspecter.
mn_mn: PEM эсвэл DER хэлбэрийн X.509 гэрчилгээг чирж тавих, эсвэл текстээ буулгаж шалгана.
ru_ru: Перетащите сертификат X.509 в формате PEM или DER либо вставьте его текстом для просмотра.
zh_cn: 拖入 PEM 或 DER 格式的 X.509 证书，或以文本形式粘贴以查看详情。

# Verify_DropZone_Hint
source: Drop a PEM/CER/CRT file here — or click the button to choose one.
ar_sa: أفلت ملف PEM/CER/CRT هنا — أو اضغط الزر لاختيار ملف.
es_es: Suelte aquí un archivo PEM/CER/CRT o pulse el botón para elegir uno.
fr_fr: Déposez ici un fichier PEM/CER/CRT — ou cliquez pour en choisir un.
mn_mn: PEM/CER/CRT файлыг энд чирж тавь — эсвэл сонгох товчийг дар.
ru_ru: Перетащите сюда файл PEM/CER/CRT — или нажмите кнопку, чтобы выбрать его.
zh_cn: 将 PEM/CER/CRT 文件拖到此处 —— 或点击按钮选择文件。

# Verify_Paste_Hint
source: …or paste the PEM:
ar_sa: …أو الصق PEM:
es_es: …o pegue el PEM:
fr_fr: …ou collez le PEM :
mn_mn: Эсвэл PEM-ийг буулга:
ru_ru: …или вставьте PEM:
zh_cn: …或粘贴 PEM：

# Verify_PickFile
source: Choose file
ar_sa: اختيار ملف
es_es: Elegir archivo
fr_fr: Choisir un fichier
mn_mn: Файл сонгох
ru_ru: Выбрать файл
zh_cn: 选择文件

# Verify_Parse
source: Parse text
ar_sa: تحليل النص
es_es: Analizar el texto
fr_fr: Analyser le texte
mn_mn: Текст-ээс уншуулах
ru_ru: Разобрать текст
zh_cn: 解析文本

# Verify_Clear
source: Clear
ar_sa: مسح
es_es: Borrar
fr_fr: Effacer
mn_mn: Цэвэрлэх
ru_ru: Очистить
zh_cn: 清除

# Verify_Section_Identity
source: Subject & issuer
ar_sa: الموضوع وجهة الإصدار
es_es: Sujeto y emisor
fr_fr: Sujet et émetteur
mn_mn: Эзэмшигч ба бүртгэгч
ru_ru: Владелец и издатель
zh_cn: 持有者与颁发者

# Verify_Section_Validity
source: Validity period
ar_sa: فترة الصلاحية
es_es: Periodo de validez
fr_fr: Période de validité
mn_mn: Хүчинтэй хугацаа
ru_ru: Срок действия
zh_cn: 有效期

# Verify_Section_Crypto
source: Cryptography
ar_sa: التشفير
es_es: Criptografía
fr_fr: Cryptographie
mn_mn: Криптограф
ru_ru: Криптография
zh_cn: 密码学

# Verify_Section_Fingerprints
source: Fingerprints
ar_sa: البصمات
es_es: Huellas
fr_fr: Empreintes
mn_mn: Хурууны хээ
ru_ru: Отпечатки
zh_cn: 指纹

# Verify_Section_KeyUsage
source: Key usage
ar_sa: استخدام المفتاح
es_es: Uso de la clave
fr_fr: Utilisation de la clé
mn_mn: Түлхүүрийн хэрэглээ
ru_ru: Назначение ключа
zh_cn: 密钥用途

# Verify_Section_San
source: SAN — Subject Alternative Names
ar_sa: SAN — الأسماء البديلة للموضوع
es_es: SAN: nombres alternativos del sujeto
fr_fr: SAN — noms alternatifs du sujet
mn_mn: SAN — Альтернатив нэр
ru_ru: SAN — альтернативные имена владельца
zh_cn: SAN —— 主体备用名称

# Verify_Field_Subject
source: Subject
ar_sa: الموضوع
es_es: Sujeto
fr_fr: Sujet
ru_ru: Владелец
zh_cn: 持有者

# Verify_Field_Issuer
source: Issuer
ar_sa: جهة الإصدار
es_es: Emisor
fr_fr: Émetteur
ru_ru: Издатель
zh_cn: 颁发者

# Verify_Field_Serial
source: Serial number
ar_sa: الرقم التسلسلي
es_es: Número de serie
fr_fr: Numéro de série
mn_mn: Сериал дугаар
ru_ru: Серийный номер
zh_cn: 序列号

# Verify_Field_NotBefore
source: Not before
ar_sa: صالحة من
es_es: Válido desde
fr_fr: Valide à partir du
mn_mn: Эхэлсэн
ru_ru: Действителен с
zh_cn: 生效日期

# Verify_Field_NotAfter
source: Not after
ar_sa: صالحة حتى
es_es: Válido hasta
fr_fr: Valide jusqu'au
mn_mn: Дуусах
ru_ru: Действителен до
zh_cn: 失效日期

# Verify_Field_SignatureAlgorithm
source: Signature algorithm
ar_sa: خوارزمية التوقيع
es_es: Algoritmo de firma
fr_fr: Algorithme de signature
mn_mn: Гарын үсгийн алгоритм
ru_ru: Алгоритм подписи
zh_cn: 签名算法

# Verify_Field_PublicKey
source: Public key
ar_sa: المفتاح العام
es_es: Clave pública
fr_fr: Clé publique
mn_mn: Нийтийн түлхүүр
ru_ru: Открытый ключ
zh_cn: 公钥

# Verify_Validity_Valid
source: Valid
ar_sa: صالحة
es_es: Válido
fr_fr: Valide
mn_mn: Хүчинтэй
ru_ru: Действителен
zh_cn: 有效

# Verify_Validity_Expired
source: Expired
ar_sa: منتهية الصلاحية
es_es: Caducado
fr_fr: Expiré
mn_mn: Хугацаа дууссан
ru_ru: Срок истёк
zh_cn: 已过期

# Verify_Validity_NotYetValid
source: Not yet valid
ar_sa: غير صالحة بعد
es_es: Aún no válido
fr_fr: Pas encore valide
mn_mn: Хараахан хүчинтэй болоогүй
ru_ru: Ещё не действителен
zh_cn: 尚未生效

# Verify_Error_EmptyInput
source: Input is empty.
ar_sa: الإدخال فارغ.
es_es: La entrada está vacía.
fr_fr: La saisie est vide.
mn_mn: Текст хоосон байна.
ru_ru: Поле ввода пусто.
zh_cn: 输入内容为空。

# Login_Title
source: Sign in
ar_sa: تسجيل الدخول
es_es: Iniciar sesión
fr_fr: Connexion
mn_mn: Нэвтрэх
ru_ru: Вход
zh_cn: 登录

# Login_Subtitle
source: Sign in with the e-ID Mongolia app
ar_sa: سجّل الدخول عبر تطبيق e-ID Mongolia
es_es: Inicie sesión con la aplicación e-ID Mongolia
fr_fr: Connectez-vous avec l'application e-ID Mongolia
mn_mn: e-ID Mongolia аппаар нэвтрэх
ru_ru: Войдите с помощью приложения e-ID Mongolia
zh_cn: 使用 e-ID Mongolia 应用登录

# Login_NationalId
source: National ID
ar_sa: رقم الهوية الوطنية
es_es: Documento nacional de identidad
fr_fr: Numéro national d'identité
mn_mn: Регистрийн дугаар (National ID)
ru_ru: Регистрационный номер
zh_cn: 登记号

# Login_NationalId_Hint
source: Example: AA00000000 (Cyrillic letters + 8 digits)
ar_sa: مثال: AA00000000 (حرفان سيريليان + 8 أرقام)
es_es: Ejemplo: AA00000000 (letras cirílicas + 8 dígitos)
fr_fr: Exemple : AA00000000 (lettres cyrilliques + 8 chiffres)
mn_mn: Жишээ: AA00000000 (Кирилл үсэг + 8 цифр)
ru_ru: Пример: AA00000000 (буквы кириллицы + 8 цифр)
zh_cn: 示例：AA00000000（西里尔字母 + 8 位数字）

# Login_VerificationCode
source: VERIFICATION CODE
ar_sa: رمز التحقق
es_es: CÓDIGO DE VERIFICACIÓN
fr_fr: CODE DE VÉRIFICATION
mn_mn: БАТАЛГААЖУУЛАХ КОД
ru_ru: КОД ПОДТВЕРЖДЕНИЯ
zh_cn: 验证码

# Login_Waiting_Title
source: Open the e-ID Mongolia app
ar_sa: افتح تطبيق e-ID Mongolia
es_es: Abra la aplicación e-ID Mongolia
fr_fr: Ouvrez l'application e-ID Mongolia
mn_mn: e-ID Mongolia аппаа нээнэ үү
ru_ru: Откройте приложение e-ID Mongolia
zh_cn: 请打开 e-ID Mongolia 应用

# Login_Waiting_Subtitle
source: A sign-in request has arrived in the e-ID Mongolia app on your phone
ar_sa: وصل طلب تسجيل دخول إلى تطبيق e-ID Mongolia على هاتفك
es_es: Ha llegado una solicitud de inicio de sesión a la aplicación e-ID Mongolia de su teléfono
fr_fr: Une demande de connexion est arrivée dans l'application e-ID Mongolia sur votre téléphone
mn_mn: Утсан дээрх e-ID Mongolia апп-д нэвтрэлтийн хүсэлт ирсэн байна
ru_ru: Запрос на вход поступил в приложение e-ID Mongolia на вашем телефоне
zh_cn: 登录请求已发送至您手机上的 e-ID Mongolia 应用

# Login_Waiting_Countdown
source: Waiting...
ar_sa: بالانتظار…
es_es: Esperando…
fr_fr: En attente…
mn_mn: Хүлээж байна...
ru_ru: Ожидание...
zh_cn: 等待中...

# Login_Initiate
source: Sign in
ar_sa: تسجيل الدخول
es_es: Iniciar sesión
fr_fr: Se connecter
mn_mn: Нэвтрэх
ru_ru: Войти
zh_cn: 登录

# Login_Initiate_Loading
source: Reading...
ar_sa: جارٍ القراءة…
es_es: Leyendo…
fr_fr: Lecture…
mn_mn: Уншиж байна...
ru_ru: Считывание...
zh_cn: 读取中...

# Login_Cancel
source: Cancel
ar_sa: إلغاء
es_es: Cancelar
fr_fr: Annuler
mn_mn: Цуцлах
ru_ru: Отмена
zh_cn: 取消

# Login_TryAgain
source: Try again
ar_sa: إعادة المحاولة
es_es: Reintentar
fr_fr: Réessayer
mn_mn: Дахин оролдох
ru_ru: Повторить
zh_cn: 重试

# Login_SignOut
source: Sign out
ar_sa: تسجيل الخروج
es_es: Cerrar sesión
fr_fr: Se déconnecter
mn_mn: Гарах
ru_ru: Выйти
zh_cn: 退出登录

# Login_Success_Title
source: Success!
ar_sa: تم بنجاح!
es_es: ¡Correcto!
fr_fr: Réussi !
mn_mn: Амжилттай!
ru_ru: Успешно!
zh_cn: 成功！

# Login_Success_Subtitle
source: Redirecting...
ar_sa: جارٍ التحويل…
es_es: Redirigiendo…
fr_fr: Redirection…
mn_mn: Шилжүүлж байна...
ru_ru: Перенаправление...
zh_cn: 正在跳转...

# Login_Footer_NewAccount
source: Create new account
ar_sa: إنشاء حساب جديد
es_es: Crear una cuenta nueva
fr_fr: Créer un compte
mn_mn: Шинэ бүртгэл үүсгэх
ru_ru: Создать новый аккаунт
zh_cn: 创建新账户

# Login_Footer_Help
source: Need help?
ar_sa: تحتاج مساعدة؟
es_es: ¿Necesita ayuda?
fr_fr: Besoin d'aide ?
mn_mn: Тусламж хэрэгтэй юу?
ru_ru: Нужна помощь?
zh_cn: 需要帮助？

# Login_Error_NationalIdRequired
source: National ID is required.
ar_sa: رقم الهوية الوطنية مطلوب.
es_es: El documento nacional de identidad es obligatorio.
fr_fr: Le numéro national d'identité est obligatoire.
mn_mn: Регистрийн дугаараа оруулна уу.
ru_ru: Укажите регистрационный номер.
zh_cn: 请填写登记号。

# Login_Error_UserNotFound
source: No account registered with this national ID.
ar_sa: لا يوجد حساب مسجَّل بهذا الرقم الوطني.
es_es: No hay ninguna cuenta registrada con ese documento nacional.
fr_fr: Aucun compte enregistré avec ce numéro national.
mn_mn: Энэ регистрийн дугаараар бүртгэлгүй байна.
ru_ru: Аккаунт с таким регистрационным номером не найден.
zh_cn: 未找到使用该登记号注册的账户。

# Login_Error_Generic
source: An error occurred
ar_sa: حدث خطأ
es_es: Se produjo un error
fr_fr: Une erreur est survenue
mn_mn: Алдаа гарлаа
ru_ru: Произошла ошибка
zh_cn: 发生错误

# Login_Error_Timeout
source: Session timed out
ar_sa: انتهت مهلة الجلسة
es_es: La sesión ha caducado
fr_fr: La session a expiré
mn_mn: Хугацаа дууслаа
ru_ru: Время сессии истекло
zh_cn: 会话已超时

# Login_Error_Declined
source: User declined on phone
ar_sa: تم الرفض على الهاتف
es_es: Rechazado en el teléfono
fr_fr: Refusé sur le téléphone
mn_mn: Хэрэглэгч татгалзлаа
ru_ru: Пользователь отклонил запрос на телефоне
zh_cn: 用户已在手机上拒绝

# Login_Error_VerifyFailed
source: Verification failed
ar_sa: فشل التحقق
es_es: Falló la verificación
fr_fr: Échec de la vérification
mn_mn: Баталгаажуулалт амжилтгүй боллоо
ru_ru: Проверка не удалась
zh_cn: 验证失败
